understanding-cpu-bandwidth-throttling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-26 Sat 09:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding CPU Bandwidth Throttling with the Completely Fair Scheduler and Control Groups</title>
<meta name="author" content="Frank Burnham" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Understanding CPU Bandwidth Throttling with the Completely Fair Scheduler and Control Groups</h1>
<p>
NOTE: This is for the linux kernel version 6.1.
</p>

<p>
NOTE: I have no idea what I'm talking about.
</p>

<p>
TODO Overview of how each section joins to make throttling work (use a mermaid diagram! <a href="https://github.com/arnm/ob-mermaid">https://github.com/arnm/ob-mermaid</a>)
</p>

<div id="text-table-of-contents" role="doc-toc">
<ul>
