understanding-cpu-bandwidth-throttling.html
<li><a href="#orgda000d0">1. How Consumed CPU Bandwidth is Calculated and Tracked for <code>cgroups</code></a></li>
<li><a href="#org2efd3be">2. How <code>cgroups</code> are Throttled</a></li>
</ul>
</div>
<div id="outline-container-orgda000d0" class="outline-2">
<h2 id="orgda000d0"><span class="section-number-2">1.</span> How Consumed CPU Bandwidth is Calculated and Tracked for <code>cgroups</code></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>update_curr</code> is called, at least, when a <code>sched_entity</code> is enqueued or dequeued (by <code>enqueue_entity</code> and <code>dequeue_entity</code> respectively). It calls <code>cgroup_account_cputime</code> which handles
propagating the consumed bandwitdth to all entities in the <code>cgroup</code>.
</p>

<p>
From <code>include/linux/sched.h</code>
</p>

<div class="org-src-container">
<pre class="src src-c" id="org627c9ca"><span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_group</span> {
  <span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
<span style="color: #828997;">#ifdef</span> CONFIG_FAIR_GROUP_SCHED
        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">schedulable entities of this group on each CPU</span><span style="color: #5C6370;"> */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     **<span style="color: #E06C75;">se</span>;
        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">runqueue "owned" by this group on each CPU</span><span style="color: #5C6370;"> */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cfs_rq</span>           **<span style="color: #E06C75;">cfs_rq</span>;
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>           <span style="color: #E06C75;">shares</span>;

        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">A positive value indicates that this is a SCHED_IDLE group.</span><span style="color: #5C6370;"> */</span>
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">idle</span>;

<span style="color: #828997;">#ifdef</span>  CONFIG_SMP
        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * load_avg can be heavily contended at clock tick time, so put
         * it in its own cacheline separated from the fields above which
         * will also be accessed at each tick.
</span><span style="color: #5C6370;">         */</span>
        atomic_long_t           <span style="color: #E5C07B;">load_avg</span> <span style="color: #E06C75;">____cacheline_aligned</span>;
<span style="color: #828997;">#endif</span>
<span style="color: #828997;">#endif</span>

  <span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_group</span>       *<span style="color: #E06C75;">parent</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">list_head</span>        <span style="color: #E06C75;">siblings</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">list_head</span>        <span style="color: #E06C75;">children</span>;

  <span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cfs_bandwidth</span>    <span style="color: #E06C75;">cfs_bandwidth</span>;

  <span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>};

<span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
<span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CFS-related fields in a runqueue</span><span style="color: #5C6370;"> */</span>
<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cfs_rq</span> {
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">load_weight</span>      <span style="color: #E06C75;">load</span>;
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span>            <span style="color: #E06C75;">nr_running</span>;
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span>            <span style="color: #E06C75;">h_nr_running</span>;      <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">SCHED_{NORMAL,BATCH,IDLE}</span><span style="color: #5C6370;"> */</span>
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span>            <span style="color: #E06C75;">idle_nr_running</span>;   <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">SCHED_IDLE</span><span style="color: #5C6370;"> */</span>
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span>            <span style="color: #E06C75;">idle_h_nr_running</span>; <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">SCHED_IDLE</span><span style="color: #5C6370;"> */</span>

        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">exec_clock</span>;
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">min_vruntime</span>;
<span style="color: #828997;">#ifdef</span> CONFIG_SCHED_CORE
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span>            <span style="color: #E06C75;">forceidle_seq</span>;
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">min_vruntime_fi</span>;
<span style="color: #828997;">#endif</span>

<span style="color: #828997;">#if</span><span style="color: #828997;">n</span><span style="color: #828997;">def</span> CONFIG_64BIT
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">min_vruntime_copy</span>;
<span style="color: #828997;">#endif</span>

        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">rb_root_cached</span>   <span style="color: #E06C75;">tasks_timeline</span>;

        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * 'curr' points to currently running entity on this cfs_rq.
         * It is set to NULL otherwise (i.e when none are currently running).
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     *<span style="color: #E06C75;">curr</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     *<span style="color: #E06C75;">next</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     *<span style="color: #E06C75;">last</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     *<span style="color: #E06C75;">skip</span>;

  <span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
<span style="color: #828997;">#ifdef</span> CONFIG_SMP
        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * CFS load tracking
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_avg</span>        <span style="color: #E06C75;">avg</span>;
<span style="color: #828997;">#if</span><span style="color: #828997;">n</span><span style="color: #828997;">def</span> CONFIG_64BIT
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">last_update_time_copy</span>;
<span style="color: #828997;">#endif</span>
        <span style="color: #C678DD;">struct</span> {
                raw_spinlock_t  <span style="color: #E5C07B;">lock</span> <span style="color: #E06C75;">____cacheline_aligned</span>;
                <span style="color: #E5C07B;">int</span>             <span style="color: #E06C75;">nr</span>;
                <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>   <span style="color: #E06C75;">load_avg</span>;
                <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>   <span style="color: #E06C75;">util_avg</span>;
                <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>   <span style="color: #E06C75;">runnable_avg</span>;
        } <span style="color: #E06C75;">removed</span>;

<span style="color: #828997;">#ifdef</span> CONFIG_FAIR_GROUP_SCHED
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>           <span style="color: #E06C75;">tg_load_avg_contrib</span>;
        <span style="color: #E5C07B;">long</span>                    <span style="color: #E06C75;">propagate</span>;
        <span style="color: #E5C07B;">long</span>                    <span style="color: #E06C75;">prop_runnable_sum</span>;

        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         *   h_load = weight * f(tg)
         *
         * Where f(tg) is the recursive weight fraction assigned to
         * this group.
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span>           <span style="color: #E06C75;">h_load</span>;
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">last_h_load_update</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span>     *<span style="color: #E06C75;">h_load_next</span>;
<span style="color: #828997;">#endif</span> <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CONFIG_FAIR_GROUP_SCHED</span><span style="color: #5C6370;"> */</span>
<span style="color: #828997;">#endif</span> <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CONFIG_SMP</span><span style="color: #5C6370;"> */</span>

<span style="color: #828997;">#ifdef</span> CONFIG_FAIR_GROUP_SCHED
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">rq</span>               *<span style="color: #E06C75;">rq</span>;    <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CPU runqueue to which this cfs_rq is attached</span><span style="color: #5C6370;"> */</span>

        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * leaf cfs_rqs are those that hold tasks (lowest schedulable entity in
         * a hierarchy). Non-leaf lrqs hold other higher schedulable entities
         * (like users, containers etc.)
         *
         * leaf_cfs_rq_list ties together list of leaf cfs_rq's in a CPU.
         * This list is used during load balance.
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">on_list</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">list_head</span>        <span style="color: #E06C75;">leaf_cfs_rq_list</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_group</span>       *<span style="color: #E06C75;">tg</span>;    <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">group that "owns" this runqueue</span><span style="color: #5C6370;"> */</span>

        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">Locally cached copy of our task_group's idle value</span><span style="color: #5C6370;"> */</span>
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">idle</span>;

<span style="color: #828997;">#ifdef</span> CONFIG_CFS_BANDWIDTH
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">runtime_enabled</span>;
        <span style="color: #E5C07B;">s64</span>                     <span style="color: #E06C75;">runtime_remaining</span>;

        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">throttled_pelt_idle</span>;
<span style="color: #828997;">#if</span><span style="color: #828997;">n</span><span style="color: #828997;">def</span> CONFIG_64BIT
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">throttled_pelt_idle_copy</span>;
<span style="color: #828997;">#endif</span>
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">throttled_clock</span>;
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">throttled_clock_pelt</span>;
        <span style="color: #E5C07B;">u64</span>                     <span style="color: #E06C75;">throttled_clock_pelt_time</span>;
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">throttled</span>;
        <span style="color: #E5C07B;">int</span>                     <span style="color: #E06C75;">throttle_count</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">list_head</span>        <span style="color: #E06C75;">throttled_list</span>;
<span style="color: #828997;">#endif</span> <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CONFIG_CFS_BANDWIDTH</span><span style="color: #5C6370;"> */</span>
<span style="color: #828997;">#endif</span> <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">CONFIG_FAIR_GROUP_SCHED</span><span style="color: #5C6370;"> */</span>
};
</pre>
</div>

<p>
The <code>task_group</code> knows about the <code>sched_entities</code> and <code>cfs_rqs</code> that the group uses (one per cpu that the group uses). It also keeps track of the <code>cfs_bandwidth</code> which is used when
determining if a <code>cgroup</code> should be throttled. Each <code>cfs_rq</code> is also keeps track of bandwidth consumed.
</p>

<p>
From <code>kernel/sched/fair.c</code> (cfs scheduler)
</p>

<div class="org-src-container">
<pre class="src src-c" id="org9ce4cfd"><span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
 * Update the current task's runtime statistics.
</span><span style="color: #5C6370;"> */</span>
<span style="color: #C678DD;">static</span> <span style="color: #E5C07B;">void</span> <span style="color: #61AFEF;">update_curr</span>(<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cfs_rq</span> *<span style="color: #E06C75;">cfs_rq</span>)
{
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_entity</span> *<span style="color: #E06C75;">curr</span> = cfs_rq-&gt;curr;
        <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">now</span> = rq_clock_task(rq_of(cfs_rq));
        <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">delta_exec</span>;

        <span style="color: #C678DD;">if</span> (unlikely(!curr))
                <span style="color: #C678DD;">return</span>;

        delta_exec = now - curr-&gt;exec_start;
        <span style="color: #C678DD;">if</span> (unlikely((<span style="color: #E5C07B;">s64</span>)delta_exec &lt;= 0))
                <span style="color: #C678DD;">return</span>;

        curr-&gt;exec_start = now;

        <span style="color: #C678DD;">if</span> (schedstat_enabled()) {
                <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">sched_statistics</span> *<span style="color: #E06C75;">stats</span>;

                stats = __schedstats_from_se(curr);
                __schedstat_set(stats-&gt;exec_max,
                                max(delta_exec, stats-&gt;exec_max));
        }

        curr-&gt;sum_exec_runtime += delta_exec;
        schedstat_add(cfs_rq-&gt;exec_clock, delta_exec);

        curr-&gt;vruntime += calc_delta_fair(delta_exec, curr);
        update_min_vruntime(cfs_rq);

        <span style="color: #C678DD;">if</span> (entity_is_task(curr)) {
                <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_struct</span> *<span style="color: #E06C75;">curtask</span> = task_of(curr);

                trace_sched_stat_runtime(curtask, delta_exec, curr-&gt;vruntime);
                cgroup_account_cputime(curtask, delta_exec);
                account_group_exec_runtime(curtask, delta_exec);
        }

        account_cfs_rq_runtime(cfs_rq, delta_exec);
}
</pre>
</div>

<p>
<code>update_curr</code> is called for a variety of reasons like a task being enqueued or dequeued. It updates the <code>sched_entity</code> (the smallest scheduleable unit) that is currently running (or
task if the current entity is a task) in this <code>cfs_rq</code>. It calls <code>cgroup_account_cputime</code> to handle tracking bandwidth usage for a <code>cgroup</code>.
</p>

<p>
From <code>include/linux/cgroup.h</code>
</p>

<div class="org-src-container">
<pre class="src src-c" id="org37a2454"><span style="color: #C678DD;">static</span> <span style="color: #C678DD;">inline</span> <span style="color: #E5C07B;">void</span> <span style="color: #61AFEF;">cgroup_account_cputime</span>(<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_struct</span> *<span style="color: #E06C75;">task</span>,
                                          <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">delta_exec</span>)
{
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup</span> *<span style="color: #E06C75;">cgrp</span>;

        cpuacct_charge(task, delta_exec);

        cgrp = task_dfl_cgroup(task);
        <span style="color: #C678DD;">if</span> (cgroup_parent(cgrp))
                __cgroup_account_cputime(cgrp, delta_exec);
}
</pre>
</div>

<p>
Given a task struct and a change in execution time, <code>cgroup_account_cputime</code> charges the task for the consumed bandwidth. If the task is a member of a group and it is not the parent,
handle group accounting.
</p>

<p>
From <code>kernel/sched/cpuacct.c</code>
</p>

<div class="org-src-container">
<pre class="src src-c" id="org40b46dd"><span style="color: #5C6370;">/* </span><span style="color: #5C6370;">track CPU usage of a group of tasks and its child groups</span><span style="color: #5C6370;"> */</span>
<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cpuacct</span> {
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_subsys_state</span>      <span style="color: #E06C75;">css</span>;
        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">cpuusage holds pointer to a u64-type object on every CPU</span><span style="color: #5C6370;"> */</span>
        <span style="color: #E5C07B;">u64</span> <span style="color: #E5C07B;">__percpu</span>    *<span style="color: #E06C75;">cpuusage</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">kernel_cpustat</span> <span style="color: #E06C75;">__percpu</span>  *cpustat;
};

<span style="color: #5C6370;">// </span><span style="color: #5C6370;">stuff omitted
</span>
<span style="color: #E5C07B;">void</span> <span style="color: #61AFEF;">cpuacct_charge</span>(<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_struct</span> *<span style="color: #E06C75;">tsk</span>, <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">cputime</span>)
{
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">int</span> <span style="color: #E06C75;">cpu</span> = task_cpu(tsk);
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cpuacct</span> *<span style="color: #E06C75;">ca</span>;

        lockdep_assert_rq_held(cpu_rq(cpu));

        <span style="color: #C678DD;">for</span> (ca = task_ca(tsk); ca; ca = parent_ca(ca))
                *per_cpu_ptr(ca-&gt;cpuusage, cpu) += cputime;
}
</pre>
</div>

<p>
<code>cpuacct_charge</code> charges a task by locking the run queue for the cpu the task was on (possibly to avoid possible changes to the real cputime value). Then for each task in this group
of tasks (not cgroup) charges the given <code>cputime</code> (which comes to <code>cgroup_account_cputime</code>, the caller, as the change in execution time for the task).
</p>

<p>
From <code>include/linux/cgroup-defs.h</code> (resource statistics) and <code>kernel/cgroup/rstat.c</code>
</p>

<div class="org-src-container">
<pre class="src src-c" id="orgde27361"><span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_base_stat</span> {
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">task_cputime</span> <span style="color: #E06C75;">cputime</span>;

<span style="color: #828997;">#ifdef</span> CONFIG_SCHED_CORE
        <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">forceidle_sum</span>;
<span style="color: #828997;">#endif</span>
};

<span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
 * rstat - cgroup scalable recursive statistics.  Accounting is done
 * per-cpu in cgroup_rstat_cpu which is then lazily propagated up the
 * hierarchy on reads.
 *
 * When a stat gets updated, the cgroup_rstat_cpu and its ancestors are
 * linked into the updated tree.  On the following read, propagation only
 * considers and consumes the updated tree.  This makes reading O(the
 * number of descendants which have been active since last read) instead of
 * O(the total number of descendants).
 *
 * This is important because there can be a lot of (draining) cgroups which
 * aren't active and stat may be read frequently.  The combination can
 * become very expensive.  By propagating selectively, increasing reading
 * frequency decreases the cost of each read.
 *
 * This struct hosts both the fields which implement the above -
 * updated_children and updated_next - and the fields which track basic
 * resource statistics on top of it - bsync, bstat and last_bstat.
</span><span style="color: #5C6370;"> */</span>
<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_rstat_cpu</span> {
        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * -&gt;bsync protects -&gt;bstat.  These are the only fields which get
         * updated in the hot path.
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">u64_stats_sync</span> <span style="color: #E06C75;">bsync</span>;
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_base_stat</span> <span style="color: #E06C75;">bstat</span>;

        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * Snapshots at the last reading.  These are used to calculate the
         * deltas to propagate to the global counters.
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_base_stat</span> <span style="color: #E06C75;">last_bstat</span>;

        <span style="color: #5C6370;">/*</span><span style="color: #5C6370;">
         * Child cgroups with stat updates on this cpu since the last read
         * are linked on the parent's -&gt;updated_children through
         * -&gt;updated_next.
         *
         * In addition to being more compact, singly-linked list pointing
         * to the cgroup makes it unnecessary for each per-cpu struct to
         * point back to the associated cgroup.
         *
         * Protected by per-cpu cgroup_rstat_cpu_lock.
</span><span style="color: #5C6370;">         */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup</span> *<span style="color: #E06C75;">updated_children</span>;        <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">terminated by self cgroup</span><span style="color: #5C6370;"> */</span>
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup</span> *<span style="color: #E06C75;">updated_next</span>;            <span style="color: #5C6370;">/* </span><span style="color: #5C6370;">NULL iff not on the list</span><span style="color: #5C6370;"> */</span>
};
</pre>
</div>

<p>
Looks like <code>cgroup_rstat_cpu</code> fits in by providing some structure to track a cgroups cpu resource statistics.
</p>

<div class="org-src-container">
<pre class="src src-c" id="org7c2f370"><span style="color: #E5C07B;">void</span> <span style="color: #61AFEF;">__cgroup_account_cputime</span>(<span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup</span> *<span style="color: #E06C75;">cgrp</span>, <span style="color: #E5C07B;">u64</span> <span style="color: #E06C75;">delta_exec</span>)
{
        <span style="color: #C678DD;">struct</span> <span style="color: #E5C07B;">cgroup_rstat_cpu</span> *<span style="color: #E06C75;">rstatc</span>;
        <span style="color: #E5C07B;">unsigned</span> <span style="color: #E5C07B;">long</span> <span style="color: #E06C75;">flags</span>;

        rstatc = cgroup_base_stat_cputime_account_begin(cgrp, &amp;flags);
        rstatc-&gt;bstat.cputime.sum_exec_runtime += delta_exec;
        cgroup_base_stat_cputime_account_end(cgrp, rstatc, flags);
}
</pre>
</div>

<p>
<code>__cgroup_accocunt_cputime</code> updates the stats for a cgroup by getting the <code>rstatc</code> (in what looks like a locking manner) and adds the change in runtime to the current <code>sum_exec_runtime</code>
</p>
</div>
</div>
